src/InformationRegisters/ИС_Ozon_ЗначенияХарактеристикПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_ЗначенияХарактеристикПоКатегориям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_КатегорииТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_ЗначенияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_ЗначенияХарактеристикПоКатегориям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗначенияХарактеристик(Категория, Характеристика, СтрокаПоиска = Неопределено) Экспорт
	МассивКатегорий = Новый Массив;
	МассивКатегорий.Добавить(Категория);
	МассивКатегорий.Добавить(ПредопределенноеЗначение("Справочник.ИС_Ozon_КатегорииТоваров.ПустаяСсылка"));

	Если ТипЗнч(Характеристика) = Тип("Строка") Тогда
		Характеристика = Справочники.ИС_Ozon_Характеристики.НайтиПоКоду(Число(Характеристика), Истина);
	КонецЕсли;

	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Отбор = " И Ozon_ЗначенияХарактеристик.Наименование Подобно ""%" + СтрокаПоиска + "%""";
	Иначе
		Отбор = "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Ozon_ЗначенияХарактеристик.Ссылка КАК ЗначениеХарактеристики
				   |ИЗ
				   |	РегистрСведений.ИС_Ozon_ЗначенияХарактеристикПоКатегориям КАК Ozon_ЗначенияХарактеристикПоКатегориям
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_ЗначенияХарактеристик КАК Ozon_ЗначенияХарактеристик
				   |		ПО Ozon_ЗначенияХарактеристикПоКатегориям.ЗначениеХарактеристики = Ozon_ЗначенияХарактеристик.Ссылка
				   |ГДЕ
				   |	Ozon_ЗначенияХарактеристикПоКатегориям.Категория В (&МассивКатегорий)
				   |	И Ozon_ЗначенияХарактеристикПоКатегориям.Характеристика = &Характеристика" + Отбор;

	Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса.ВыгрузитьКолонку("ЗначениеХарактеристики");

КонецФункции

#КонецОбласти

#КонецЕсли
